---
kind: property
id: P:Autodesk.Revit.DB.NumberSystem.JustifyOffset
source: html/27ed4b99-aeb4-9e4d-6495-8ae31de38f64.htm
---
# Autodesk.Revit.DB.NumberSystem.JustifyOffset Property

The offset to the justification curve.

## Syntax (C#)
```csharp
public double JustifyOffset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for justifyOffset must be no more than 30000 feet in absolute value.